import { IProduct } from '../../interfaces/IProduct';
import img1 from '../../assets/images/universal_shelving/img1.webp';  
import img2 from '../../assets/images/universal_shelving/img2.webp';  
import img3 from '../../assets/images/universal_shelving/img3.webp';  
import img4 from '../../assets/images/universal_shelving/img4.webp';  
import img5 from '../../assets/images/universal_shelving/img5.webp';  
import img6 from '../../assets/images/universal_shelving/img6.webp';  
import img7 from '../../assets/images/universal_shelving/img7.webp';  
import img8 from '../../assets/images/universal_shelving/img8.webp';  
import img9 from '../../assets/images/universal_shelving/img9.webp';  
import img10 from '../../assets/images/universal_shelving/img10.webp';  
import img11 from '../../assets/images/universal_shelving/img11.webp';  
import img12 from '../../assets/images/universal_shelving/img12.webp';  
import img13 from '../../assets/images/universal_shelving/img13.webp';  

class UniversalShelvingConsts {
    public static warehouseRacks: IProduct[] = [
        {
            imgUrl: img1, 
            title: 'Пристенный стеллаж',
            desc: 'Стеллажи пристенного типа представляют собой специальные конструкции, предназначенные для размещения различных групп товаров в магазине. Они устанавливаются у стен помещения, обеспечивая эффективное использование пространства.'
        },
        {
            imgUrl: img2, 
            title: 'Секция угловая внешняя',
            desc: 'Угловая внешняя секция стеллажа «Микрон» разработана с учетом рационального использования нетипового пространства магазина под выкладку товара. Угловая секция применяется в магазинах с внешними углами и колоннами.'
        },
        {
            imgUrl: img3, 
            title: 'Секция угловая внутренняя',
            desc: 'При проектировании сложных торговых залов, комбинирование внутренней угловой секции с внешней угловой секцией, значительно расширяет вариативность стеллажной системы.'
        },
        {
            imgUrl: img4, 
            title: 'Островной стеллаж',
            desc: 'Стеллаж островной представляет собой прочную и надежную конструкцию, разработанную специально для эффективного размещения различных групп товаров в магазине. Он является идеальным выбором для создания торговой зоны с учетом экономии пространства.'
        },
        {
            imgUrl: img5, 
            title: 'Секция торцевая',
            desc: 'Секция торцевая придает островным металлическим стеллажам завершенный вид. Дополнительно: ограждения полок.'
        },
        {
            imgUrl: img6, 
            title: 'Стеллаж островной без задних стенок',
            desc: 'Стеллаж предназначен для продажи товара, доступ к которому необходим с двух сторон, также на таком стеллаже можно поместить длинномерный товар.'
        },
        {
            imgUrl: img7, 
            title: 'Стеллаж островной 360º',
            desc: 'Для выкладки и демонстрации товара с четырех сторон. Вариант применения - на колесах.'
        },
        {
            imgUrl: img8, 
            title: 'Стеллаж с опорой Т',
            desc: 'Конструкция островного стеллажа с опорой Т имеет более низкую базу (на 60 мм. ниже чем в серии В3) это позволяет увеличить обьем выкладки продукции на стеллаж.'
        },
        {
            imgUrl: img9, 
            title: 'Стеллаж с опорой L',
            desc: 'Конструкция пристенного стеллажа с опорой L имеет более низкую базу (на 60 мм. ниже чем в серии В3) это позволяет увеличить объем выкладки продукции на стеллаж. Опора L обладает большими нагрузочными характеристиками за счет жесткой связки база-стойка.'
        },
        {
            imgUrl: img10, 
            title: 'Стеллаж усиленный с фронтальной стойкой',
            desc: 'Стеллаж имеет высокую грузоподъемность. Благодаря использованию фронтальной стойки может выдерживать нагрузку до 1500 кг на секцию. Предназначен для продажи тяжелого товара.'
        },
        {
            imgUrl: img11, 
            title: 'Стеллаж с фризом усиленным',
            desc: 'Стеллаж предназначен для продажи товара с полок и хранения товарного запаса на верхнем ярусе.'
        },
        {
            imgUrl: img12, 
            title: 'Стеллаж усиленный с опорой L',
            desc: 'Стеллаж усиленный с опорой L.'
        },
        {
            imgUrl: img13, 
            title: 'Островной стеллаж с торцевой полукруглой секцией',
            desc: 'Стеллаж островной с торцевой полукруглой секцией имеет навесные полки по обе стороны стеллажа.'
        },
    ];
}

export default UniversalShelvingConsts;